spec/sem4r/v13_report/fixtures/schedule_report_job-req.xml

<?xml version='1.0' encoding='UTF-8'?> 
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'>
  <env:Header>
    <email env:mustUnderstand='0'>
      ***censured***
    </email>
    <password env:mustUnderstand='0'>
      ***censured***
    </password>
    <useragent env:mustUnderstand='0'>
      Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
    </useragent>
    <developerToken env:mustUnderstand='0'>
      ***censured***
    </developerToken>
  </env:Header>
  <env:Body>
    <scheduleReportJob xmlns='https://adwords.google.com/api/adwords/v13'>
      <job xsi:type='DefinedReportJob'>
        <name>Test Report</name>
        <selectedReportType>Structure</selectedReportType>
        <startDay>2009-01-01</startDay>
        <endDay>2009-01-31</endDay>
        <aggregationTypes>Keyword</aggregationTypes>
        <crossClient>false</crossClient>
        <includeZeroImpression>false</includeZeroImpression>
        <selectedColumns>Campaign</selectedColumns>
        <selectedColumns>AdGroup</selectedColumns>
        <selectedColumns>Keyword</selectedColumns>
        <selectedColumns>KeywordTypeDisplay</selectedColumns>
      </job>
    </scheduleReportJob>
  </env:Body>
</env:Envelope>
